gcs92/fire_f11/Drivers/FM33LE0xx_FL_Driver/Inc/fm33le0xx_fl_uart.h
#define    UART_ISR_OERR_Pos                                      (16U)
#define    UART_ISR_OERR_Msk                                      (0x1U << UART_ISR_OERR_Pos)
#define    UART_ISR_OERR                                          UART_ISR_OERR_Msk

#define    UART_ISR_RXTO_Pos                                      (11U)
#define    UART_ISR_RXTO_Msk                                      (0x1U << UART_ISR_RXTO_Pos)
#define    UART_ISR_RXTO                                          UART_ISR_RXTO_Msk

#define    UART_ISR_RXBF_Pos                                      (8U)
#define    UART_ISR_RXBF_Msk                                      (0x1U << UART_ISR_RXBF_Pos)
#define    UART_ISR_RXBF                                          UART_ISR_RXBF_Msk

#define    UART_ISR_NEWKF_Pos                                     (7U)
#define    UART_ISR_NEWKF_Msk                                     (0x1U << UART_ISR_NEWKF_Pos)
#define    UART_ISR_NEWKF                                         UART_ISR_NEWKF_Msk

#define    UART_ISR_TXOERR_Pos                                    (2U)
#define    UART_ISR_TXOERR_Msk                                    (0x1U << UART_ISR_TXOERR_Pos)
#define    UART_ISR_TXOERR                                        UART_ISR_TXOERR_Msk

#define    UART_ISR_TXBE_Pos                                      (1U)
#define    UART_ISR_TXBE_Msk                                      (0x1U << UART_ISR_TXBE_Pos)
#define    UART_ISR_TXBE                                          UART_ISR_TXBE_Msk

#define    UART_ISR_TXSE_Pos                                      (0U)
#define    UART_ISR_TXSE_Msk                                      (0x1U << UART_ISR_TXSE_Pos)
#define    UART_ISR_TXSE                                          UART_ISR_TXSE_Msk

#define    UART_TODR_TXDLY_LEN_Pos                                (8U)
#define    UART_TODR_TXDLY_LEN_Msk                                (0xffU << UART_TODR_TXDLY_LEN_Pos)
#define    UART_TODR_TXDLY_LEN                                    UART_TODR_TXDLY_LEN_Msk

#define    UART_TODR_RXTO_LEN_Pos                                 (0U)
#define    UART_TODR_RXTO_LEN_Msk                                 (0xffU << UART_TODR_RXTO_LEN_Pos)
#define    UART_TODR_RXTO_LEN                                     UART_TODR_RXTO_LEN_Msk

#define    UART_IER_RXIE_Pos                                      (2U)
#define    UART_IER_RXIE_Msk                                      (0x1U << UART_IER_RXIE_Pos)
#define    UART_IER_RXIE                                          UART_IER_RXIE_Msk

#define    UART_IER_TXIE_Pos                                      (1U)
#define    UART_IER_TXIE_Msk                                      (0x1U << UART_IER_TXIE_Pos)
#define    UART_IER_TXIE                                          UART_IER_TXIE_Msk

#define    UART_IER_LSIE_Pos                                      (0U)
#define    UART_IER_LSIE_Msk                                      (0x1U << UART_IER_LSIE_Pos)
#define    UART_IER_LSIE                                          UART_IER_LSIE_Msk

#define    UART_ISR_WAIT_RPT_Pos                                  (18U)
#define    UART_ISR_WAIT_RPT_Msk                                  (0x1U << UART_ISR_WAIT_RPT_Pos)
#define    UART_ISR_WAIT_RPT                                      UART_ISR_WAIT_RPT_Msk

#define    UART_ISR_TXBUSY_Pos                                    (17U)
#define    UART_ISR_TXBUSY_Msk                                    (0x1U << UART_ISR_TXBUSY_Pos)
#define    UART_ISR_TXBUSY                                        UART_ISR_TXBUSY_Msk

#define    UART_ISR_RXBUSY_Pos                                    (16U)
#define    UART_ISR_RXBUSY_Msk                                    (0x1U << UART_ISR_RXBUSY_Pos)
#define    UART_ISR_RXBUSY                                        UART_ISR_RXBUSY_Msk

#define    UART_ISR_TPARERR_Pos                                   (11U)
#define    UART_ISR_TPARERR_Msk                                   (0x1U << UART_ISR_TPARERR_Pos)
#define    UART_ISR_TPARERR                                       UART_ISR_TPARERR_Msk

#define    UART_ISR_RPARERR_Pos                                   (10U)
#define    UART_ISR_RPARERR_Msk                                   (0x1U << UART_ISR_RPARERR_Pos)
#define    UART_ISR_RPARERR                                       UART_ISR_RPARERR_Msk

#define    UART_ISR_FRERR_Pos                                     (9U)
#define    UART_ISR_FRERR_Msk                                     (0x1U << UART_ISR_FRERR_Pos)
#define    UART_ISR_FRERR                                         UART_ISR_FRERR_Msk

#define    UART_ISR_OVERR_Pos                                     (8U)
#define    UART_ISR_OVERR_Msk                                     (0x1U << UART_ISR_OVERR_Pos)
#define    UART_ISR_OVERR                                         UART_ISR_OVERR_Msk

#define    UART_ISR_RXIF_Pos                                      (2U)
#define    UART_ISR_RXIF_Msk                                      (0x1U << UART_ISR_RXIF_Pos)
#define    UART_ISR_RXIF                                          UART_ISR_RXIF_Msk

#define    UART_ISR_TXIF_Pos                                      (1U)
#define    UART_ISR_TXIF_Msk                                      (0x1U << UART_ISR_TXIF_Pos)
#define    UART_ISR_TXIF                                          UART_ISR_TXIF_Msk

#define    UART_ISR_ERRIF_Pos                                     (0U)
#define    UART_ISR_ERRIF_Msk                                     (0x1U << UART_ISR_ERRIF_Pos)
#define    UART_ISR_ERRIF                                         UART_ISR_ERRIF_Msk


#define    FL_UART_INFRARED_POLARITY_NORMAL                       (0x0U << UART_IRCR_IRFLAG_Pos)
#define    FL_UART_INFRARED_POLARITY_INVERT                       (0x1U << UART_IRCR_IRFLAG_Pos)


#define    FL_UART_UART_MODESEL_FULL_DUPLEX                       (0x0U << UART_MCR_HDSEL_Pos)
#define    FL_UART_UART_MODESEL_HALF_DUPLEX                       (0x1U << UART_MCR_HDSEL_Pos)


#define    FL_UART_LIN_MODESEL_MASTER                             (0x0U << UART_MCR_LINMD_Pos)
#define    FL_UART_LIN_MODESEL_SLAVE                              (0x1U << UART_MCR_LINMD_Pos)


#define    FL_UART_MODESEL_UART                                   (0x0U << UART_MCR_MODE_Pos)
#define    FL_UART_MODESEL_NON_UART                               (0x1U << UART_MCR_MODE_Pos)


#define    FL_UART_OVERSAMPLING_16                                (0x0U << UART_CSR_OVSM_Pos)
#define    FL_UART_OVERSAMPLING_8                                 (0x1U << UART_CSR_OVSM_Pos)


#define    FL_UART_TXIF_MODE_ALWAYS                               (0x0U << UART_CSR_DMATXIFCFG_Pos)
#define    FL_UART_TXIF_MODE_AFTER_DMA                            (0x1U << UART_CSR_DMATXIFCFG_Pos)


#define    FL_UART_BIT_ORDER_LSB_FIRST                            (0x0U << UART_CSR_BITORD_Pos)
#define    FL_UART_BIT_ORDER_MSB_FIRST                            (0x1U << UART_CSR_BITORD_Pos)


